---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..SlabFailures Members
BuiltInFailures..::..SlabFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..SlabFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CantileverValueTooBig | Cantilever value is too big. |

# See Also

BuiltInFailures..::..SlabFailures Class

Autodesk.Revit.DB Namespace